flappingFoil/backAndCompGrid/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include        "include/initialConditions"

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform $pressure;

boundaryField
{
    oversetPatch
    {
        type            overset;
    }
    inlet
    {
        type            zeroGradient;
    }
    outlet
    {
        type            fixedValue;
        value           uniform $pressure;
    }
    "(upperPatch|lowerPatch)"
    {
        type            fixedValue;
        value           uniform $pressure;
    }
    airFoil
    {
        type            zeroGradient;
    }
    flatPlate_master
    {
        type            zeroGradient;
    }
    flatPlate_slave
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }

   
}

// ************************************************************************* //
