flappingFoil/backAndCompGrid/0.orig/pointDisplacement
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointVectorField;
    object      pointDisplacement;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include        "include/initialConditions"

dimensions      [0 1 0 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{ 
     oversetPatch
    {   
	patchType       overset;
        type zeroGradient;    
       }    
    airFoil 
    {
	//!! FILL HERE !!//
    }

    flatPlate_master
    {   
	//!! FILL HERE !!//
    }
    flatPlate_slave
    {   
	//!! FILL HERE !!//
    }
    ".*"
    {  
        type            uniformFixedValue;
       uniformValue    (0 0 0);
    }
}

// ************************************************************************* //
