flappingFoil/backAndCompGrid/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh       dynamicOversetFvMesh;

solver            displacementLaplacian; 
cellZone          movingZone;

displacementLaplacianCoeffs
{
    diffusivity directional (10 70 0); // inverseDistance (hole);
    //diffusivity inverseDistance (flatPlate_master);
    //diffusivity     uniform 1;
    //interpolation patchCorrected (flatPlate) (overset);

    //diffusivity     quadratic inverseDistance (flatPlate_slave);
    //diffusivity     exponential 10 inverseDistance (flatPlate_slave);
}

// ************************************************************************* //
