flappingFoil/backAndCompGrid/system/topoSetDict_1
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
//This creates a box which is refined using refinedMeshDict
actions
(
        {
        name    cR1;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        { 
           box (-0.06 -0.12 0) (0.30 0.12 0.001);
        }
    }
    {
        name    cR1;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
            set cR1;
        }
    }

);

// ************************************************************************* //
